-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-07-15 10:48:02
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 8.0.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `fridge`
--

-- --------------------------------------------------------

--
-- 資料表結構 `ingredients`
--

CREATE TABLE `ingredients` (
  `Ingredient_id` int(2) DEFAULT NULL,
  `Ingredient_name` varchar(4) DEFAULT NULL,
  `Category` varchar(3) DEFAULT NULL,
  `Seasoning` int(1) DEFAULT NULL,
  `Measurement` varchar(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `ingredients`
--

INSERT INTO `ingredients` (`Ingredient_id`, `Ingredient_name`, `Category`, `Seasoning`, `Measurement`) VALUES
(1, '豬肉', '豬肉', NULL, '克'),
(2, '豆干', '其他', NULL, '片'),
(3, '醬油', '調味料', 1, '大匙'),
(4, '義大利麵', '其他', NULL, '克'),
(5, '洋蔥', '其他', NULL, '顆'),
(6, '奶油', '調味料', 1, '克'),
(7, '蔥', '調味料', 1, '支'),
(8, '大蒜', '其他', NULL, '顆'),
(9, '豬小排骨', '豬肉', NULL, '克'),
(10, '太白粉', '調味料', 1, '大匙'),
(11, '米酒', '調味料', 1, '大匙'),
(12, '蛋黃', '調味料', 1, '個'),
(13, '糖', '調味料', 1, '大匙'),
(14, '鎮江醋', '調味料', 1, '大匙'),
(15, '麻油', '調味料', 1, '茶匙'),
(16, '雞腿', '雞肉', NULL, '支'),
(17, '雞翅', '雞肉', NULL, '支'),
(18, '薑', '調味料', 1, '片'),
(19, '鹽', '調味料', 1, '大匙'),
(20, '紹興酒', '調味料', 1, '杯'),
(21, '冷雞湯', '雞肉', NULL, '杯'),
(22, '魚露', '調味料', 1, '杯'),
(23, '花椒粒', '調味料', 1, '茶匙'),
(24, '海蜇頭', '海鮮', NULL, '公克'),
(25, '黃瓜', '蔬菜', NULL, '條'),
(26, '蔥絲', '調味料', 1, '大匙'),
(27, '淡色醬油', '調味料', 1, '大匙'),
(28, '醋', '調味料', 1, '茶匙'),
(29, '蛤蜊', '海鮮', NULL, '斤'),
(30, '九層塔', '調味料', 1, '顆'),
(31, '辣椒', '調味料', 1, '支'),
(32, '嫩薑', '調味料', 1, '片'),
(33, '小卷', '海鮮', NULL, '斤'),
(34, '五花肉', '豬肉', NULL, '克'),
(35, '水發魷魚', '海鮮', NULL, '條'),
(36, '花枝', '海鮮', NULL, '隻'),
(37, '青椒', '調味料', 1, '個'),
(38, '芹菜', '蔬菜', 1, '支'),
(39, '番茄醬', '調味料', 1, '大匙'),
(40, '蚵', '海鮮', NULL, '兩'),
(41, '蒜末', '調味料', 1, '茶匙'),
(42, '豆酥', '調味料', 1, '粒'),
(43, '海蟹腳', '海鮮', NULL, '斤'),
(44, '薑末', '調味料', 1, '茶匙'),
(45, '鯛魚片', '海鮮', NULL, '包'),
(46, '青蒜', '調味料', 1, '支'),
(47, '蛋白', '調味料', 1, '粒'),
(48, '草蝦', '海鮮', NULL, '隻'),
(49, '黑胡椒粉', '調味料', 1, '茶匙'),
(50, '中卷', '海鮮', NULL, '斤'),
(51, '黑麻油', '調味料', 1, '大匙'),
(52, '鮮魷魚', '海鮮', NULL, '條'),
(53, '西芹', '蔬菜', 1, '支'),
(54, '紅蘿蔔', '其他', NULL, '條'),
(55, '豬肉片', '豬肉', NULL, '克'),
(56, '蠔油', '調味料', 1, '茶匙'),
(57, '水', '調味料', 1, '大匙'),
(58, '豬絞肉', '豬肉', NULL, '克'),
(59, '小番茄', '其他', NULL, '顆'),
(60, '檸檬汁', '調味料', 1, '茶匙'),
(61, '味霖', '調味料', 1, '大匙'),
(62, '鮮味炒手', '調味料', 1, '茶匙'),
(63, '番茄', '蔬菜', NULL, '克'),
(64, '鴻喜菇', '其他', NULL, '包'),
(65, '啤酒', '調味料', 1, 'cc'),
(66, '鹹猪肉', '豬肉', NULL, '克'),
(67, '大蔥', '調味料', 1, '支'),
(68, '油', '調味料', 1, '大匙'),
(69, '菠菜', '蔬菜', NULL, '克'),
(70, '沙茶', '調味料', 1, '大匙'),
(71, '冰糖', '調味料', 1, '大匙');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
